app/Views/admin/conferences.php

                $role   = strtolower(session('user_role') ?? 'admin');
                $prefix = $role === 'secretary' ? 'secretary' : 'admin';
                $db = \Config\Database::connect();
                $violations = $db->table('violations')->get()->getResultArray();
---
SELECT *
FROM `violations`