app/Views/admin/student_violation.php

SELECT *
FROM `violations`
---
                $role   = strtolower(session('role') ?? 'admin');
                $prefix = $role === 'secretary' ? 'secretary' : 'admin';
                $db = \Config\Database::connect();
                $violations = $db->table('violations')->get()->getResultArray();