app/Views/admin/student_violation.php


                        <?php
                        $db = \Config\Database::connect();
                        $violations = $db->table('violations')->get()->getResultArray();
---
SELECT *
FROM `violations`