app/Views/admin/violation_records.php

SELECT *
FROM `violations`
---
            $role   = strtolower(session('role') ?? 'admin');
            $prefix = $role === 'secretary' ? 'secretary' : 'admin';
            $db = \Config\Database::connect();
            $violations = $db->table('violations')->get()->getResultArray();