app/Controllers/Admin.php

    private function getGroupedViolationRecords(): array
    {
        $db  = \Config\Database::connect();
        $all = $db->table('violation_records vr')
            ->select('vr.*, v.violation_name')
            ->join('violations v', 'v.id = vr.violation_id', 'left')
            ->orderBy('vr.student_id')
            ->orderBy('vr.phase', 'ASC')
            ->orderBy('vr.created_at', 'ASC')
            ->get()->getResultArray();
---
SELECT `vr`.*, `v`.`violation_name`
FROM `violation_records` `vr`
LEFT JOIN `violations` `v` ON `v`.`id` = `vr`.`violation_id`
ORDER BY `vr`.`student_id`, `vr`.`phase` ASC, `vr`.`created_at` ASC